torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723bu/include/hal_com_reg.h
#define HAL_NIC_UNPLUG_ISR			0xFFFFFFFF	// The value when the NIC is unplugged for PCI.
#define HAL_NIC_UNPLUG_PCI_ISR		0xEAEAEAEA	// The value when the NIC is unplugged for PCI in PCI interrupt (page 3).

//----------------------------------------------------------------------------
//       8188 IMR/ISR bits						
//----------------------------------------------------------------------------
#define IMR_DISABLED_88E			0x0
// IMR DW0(0x0060-0063) Bit 0-31
#define IMR_TXCCK_88E				BIT30		// TXRPT interrupt when CCX bit of the packet is set	
#define IMR_PSTIMEOUT_88E			BIT29		// Power Save Time Out Interrupt
#define IMR_GTINT4_88E				BIT28		// When GTIMER4 expires, this bit is set to 1	
#define IMR_GTINT3_88E				BIT27		// When GTIMER3 expires, this bit is set to 1	
#define IMR_TBDER_88E				BIT26		// Transmit Beacon0 Error			
#define IMR_TBDOK_88E				BIT25		// Transmit Beacon0 OK			
#define IMR_TSF_BIT32_TOGGLE_88E	BIT24		// TSF Timer BIT32 toggle indication interrupt			
#define IMR_BCNDMAINT0_88E		BIT20		// Beacon DMA Interrupt 0			
#define IMR_BCNDERR0_88E			BIT16		// Beacon Queue DMA Error 0
#define IMR_HSISR_IND_ON_INT_88E	BIT15		// HSISR Indicator (HSIMR & HSISR is true, this bit is set to 1)			
#define IMR_BCNDMAINT_E_88E		BIT14		// Beacon DMA Interrupt Extension for Win7			
#define IMR_ATIMEND_88E			BIT12		// CTWidnow End or ATIM Window End
#define IMR_HISR1_IND_INT_88E		BIT11		// HISR1 Indicator (HISR1 & HIMR1 is true, this bit is set to 1)
#define IMR_C2HCMD_88E				BIT10		// CPU to Host Command INT Status, Write 1 clear	
#define IMR_CPWM2_88E				BIT9			// CPU power Mode exchange INT Status, Write 1 clear	
#define IMR_CPWM_88E				BIT8			// CPU power Mode exchange INT Status, Write 1 clear	
#define IMR_HIGHDOK_88E			BIT7			// High Queue DMA OK	
#define IMR_MGNTDOK_88E			BIT6			// Management Queue DMA OK	
#define IMR_BKDOK_88E				BIT5			// AC_BK DMA OK		
#define IMR_BEDOK_88E				BIT4			// AC_BE DMA OK	
#define IMR_VIDOK_88E				BIT3			// AC_VI DMA OK		
#define IMR_VODOK_88E				BIT2			// AC_VO DMA OK	
#define IMR_RDU_88E					BIT1			// Rx Descriptor Unavailable	
#define IMR_ROK_88E					BIT0			// Receive DMA OK

// IMR DW1(0x00B4-00B7) Bit 0-31
#define IMR_BCNDMAINT7_88E		BIT27		// Beacon DMA Interrupt 7
#define IMR_BCNDMAINT6_88E		BIT26		// Beacon DMA Interrupt 6
#define IMR_BCNDMAINT5_88E		BIT25		// Beacon DMA Interrupt 5
#define IMR_BCNDMAINT4_88E		BIT24		// Beacon DMA Interrupt 4
#define IMR_BCNDMAINT3_88E		BIT23		// Beacon DMA Interrupt 3
#define IMR_BCNDMAINT2_88E		BIT22		// Beacon DMA Interrupt 2
#define IMR_BCNDMAINT1_88E		BIT21		// Beacon DMA Interrupt 1
#define IMR_BCNDOK7_88E			BIT20		// Beacon Queue DMA OK Interrup 7
#define IMR_BCNDOK6_88E			BIT19		// Beacon Queue DMA OK Interrup 6
#define IMR_BCNDOK5_88E			BIT18		// Beacon Queue DMA OK Interrup 5
#define IMR_BCNDOK4_88E			BIT17		// Beacon Queue DMA OK Interrup 4
#define IMR_BCNDOK3_88E			BIT16		// Beacon Queue DMA OK Interrup 3
#define IMR_BCNDOK2_88E			BIT15		// Beacon Queue DMA OK Interrup 2
#define IMR_BCNDOK1_88E			BIT14		// Beacon Queue DMA OK Interrup 1
#define IMR_ATIMEND_E_88E			BIT13		// ATIM Window End Extension for Win7
#define IMR_TXERR_88E				BIT11		// Tx Error Flag Interrupt Status, write 1 clear.
#define IMR_RXERR_88E				BIT10		// Rx Error Flag INT Status, Write 1 clear
#define IMR_TXFOVW_88E				BIT9			// Transmit FIFO Overflow
#define IMR_RXFOVW_88E				BIT8			// Receive FIFO Overflow

/*===================================================================
=====================================================================
Here the register defines are for 92C. When the define is as same with 92C, 
we will use the 92C's define for the consistency
So the following defines for 92C is not entire!!!!!!
=====================================================================
=====================================================================*/
/*
Based on Datasheet V33---090401
Register Summary
Current IOREG MAP
0x0000h ~ 0x00FFh   System Configuration (256 Bytes)
0x0100h ~ 0x01FFh   MACTOP General Configuration (256 Bytes)
0x0200h ~ 0x027Fh   TXDMA Configuration (128 Bytes)
0x0280h ~ 0x02FFh   RXDMA Configuration (128 Bytes)
0x0300h ~ 0x03FFh   PCIE EMAC Reserved Region (256 Bytes)
0x0400h ~ 0x04FFh   Protocol Configuration (256 Bytes)
0x0500h ~ 0x05FFh   EDCA Configuration (256 Bytes)
0x0600h ~ 0x07FFh   WMAC Configuration (512 Bytes)
0x2000h ~ 0x3FFFh   8051 FW Download Region (8196 Bytes)
*/
	//----------------------------------------------------------------------------
	//		 8192C (TXPAUSE) transmission pause 	(Offset 0x522, 8 bits)
	//----------------------------------------------------------------------------
// Note:
//	The the bits of stoping AC(VO/VI/BE/BK) queue in datasheet RTL8192S/RTL8192C are wrong,
//	the correct arragement is VO - Bit0, VI - Bit1, BE - Bit2, and BK - Bit3.
//	8723 and 88E may be not correct either in the eralier version. Confirmed with DD Tim.
// By Bruce, 2011-09-22.
#define StopBecon		BIT6
#define StopHigh			BIT5
#define StopMgt			BIT4
#define StopBK			BIT3
#define StopBE			BIT2
#define StopVI			BIT1
#define StopVO			BIT0

//----------------------------------------------------------------------------
//       8192C (RCR) Receive Configuration Register	(Offset 0x608, 32 bits)
//----------------------------------------------------------------------------
#define RCR_APPFCS				BIT31	// WMAC append FCS after pauload
#define RCR_APP_MIC				BIT30	// MACRX will retain the MIC at the bottom of the packet. 
#define RCR_APP_ICV				BIT29	// MACRX will retain the ICV at the bottom of the packet.
#define RCR_APP_PHYST_RXFF		BIT28	// PHY Status is appended before RX packet in RXFF
#define RCR_APP_BA_SSN			BIT27	// SSN of previous TXBA is appended as after original RXDESC as the 4-th DW of RXDESC.
#define RCR_NONQOS_VHT			BIT26	// Reserved
#define RCR_RSVD_BIT25			BIT25	// Reserved
#define RCR_ENMBID				BIT24	// Enable Multiple BssId. Only response ACK to the packets whose DID(A1) matching to the addresses in the MBSSID CAM Entries.
#define RCR_LSIGEN				BIT23	// Enable LSIG TXOP Protection function. Search KEYCAM for each rx packet to check if LSIGEN bit is set.
#define RCR_MFBEN				BIT22	// Enable immediate MCS Feedback function. When Rx packet with MRQ = 1'b1, then search KEYCAM to find sender's MCS Feedback function and send response.
#define RCR_RSVD_BIT21			BIT21	// Reserved
#define RCR_RSVD_BIT20			BIT20	// Reserved
#define RCR_RSVD_BIT19			BIT19	// Reserved
#define RCR_TIM_PARSER_EN		BIT18	// RX Beacon TIM Parser.
#define RCR_BM_DATA_EN			BIT17	// Broadcast data packet interrupt enable.
#define RCR_UC_DATA_EN			BIT16	// Unicast data packet interrupt enable.
#define RCR_RSVD_BIT15			BIT15	// Reserved
#define RCR_HTC_LOC_CTRL		BIT14	// MFC<--HTC=1 MFC-->HTC=0
#define RCR_AMF					BIT13	// Accept management type frame
#define RCR_ACF					BIT12	// Accept control type frame. Control frames BA, BAR, and PS-Poll (when in AP mode) are not controlled by this bit. They are controlled by ADF.
#define RCR_ADF					BIT11	// Accept data type frame. This bit also regulates BA, BAR, and PS-Poll (AP mode only).
#define RCR_RSVD_BIT10			BIT10	// Reserved
#define RCR_AICV					BIT9		// Accept ICV error packet
#define RCR_ACRC32				BIT8		// Accept CRC32 error packet 
#define RCR_CBSSID_BCN			BIT7		// Accept BSSID match packet (Rx beacon, probe rsp)
#define RCR_CBSSID_DATA		BIT6		// Accept BSSID match packet (Data)
#define RCR_CBSSID				RCR_CBSSID_DATA	// Accept BSSID match packet
#define RCR_APWRMGT			BIT5		// Accept power management packet
#define RCR_ADD3				BIT4		// Accept address 3 match packet
#define RCR_AB					BIT3		// Accept broadcast packet 
#define RCR_AM					BIT2		// Accept multicast packet 
#define RCR_APM					BIT1		// Accept physical match packet
#define RCR_AAP					BIT0		// Accept all unicast packet 


//-----------------------------------------------------
//
//	0x0000h ~ 0x00FFh	System Configuration
//
//-----------------------------------------------------

//2 SYS_ISO_CTRL
#define ISO_MD2PP				BIT(0)
#define ISO_UA2USB				BIT(1)
#define ISO_UD2CORE				BIT(2)
#define ISO_PA2PCIE				BIT(3)
#define ISO_PD2CORE				BIT(4)
#define ISO_IP2MAC				BIT(5)
#define ISO_DIOP					BIT(6)
#define ISO_DIOE					BIT(7)
#define ISO_EB2CORE				BIT(8)
#define ISO_DIOR					BIT(9)
#define PWC_EV12V				BIT(15)


//2 SYS_FUNC_EN
#define FEN_BBRSTB				BIT(0)
#define FEN_BB_GLB_RSTn		BIT(1)
#define FEN_USBA				BIT(2)
#define FEN_UPLL				BIT(3)
#define FEN_USBD				BIT(4)
#define FEN_DIO_PCIE			BIT(5)
#define FEN_PCIEA				BIT(6)
#define FEN_PPLL					BIT(7)
#define FEN_PCIED				BIT(8)
#define FEN_DIOE				BIT(9)
#define FEN_CPUEN				BIT(10)
#define FEN_DCORE				BIT(11)
#define FEN_ELDR				BIT(12)
#define FEN_EN_25_1				BIT(13)
#define FEN_HWPDN				BIT(14)
#define FEN_MREGEN				BIT(15)

//2 APS_FSMCO
#define PFM_LDALL				BIT(0)
#define PFM_ALDN				BIT(1)
#define PFM_LDKP				BIT(2)
#define PFM_WOWL				BIT(3)
#define EnPDN					BIT(4)
#define PDN_PL					BIT(5)
#define APFM_ONMAC				BIT(8)
#define APFM_OFF				BIT(9)
#define APFM_RSM				BIT(10)
#define AFSM_HSUS				BIT(11)
#define AFSM_PCIE				BIT(12)
#define APDM_MAC				BIT(13)
#define APDM_HOST				BIT(14)
#define APDM_HPDN				BIT(15)
#define RDY_MACON				BIT(16)
#define SUS_HOST				BIT(17)
#define ROP_ALD					BIT(20)
#define ROP_PWR					BIT(21)
#define ROP_SPS					BIT(22)
#define SOP_MRST				BIT(25)
#define SOP_FUSE				BIT(26)
#define SOP_ABG					BIT(27)
#define SOP_AMB					BIT(28)
#define SOP_RCK					BIT(29)
#define SOP_A8M					BIT(30)
#define XOP_BTCK				BIT(31)

//2 SYS_CLKR
#define ANAD16V_EN				BIT(0)
#define ANA8M					BIT(1)
#define MACSLP					BIT(4)
#define LOADER_CLK_EN			BIT(5)


